[   
    {
        "title": "My Hometown",
        "content1": "Hi, I am Ruofan Liao from Shenzhen, Guangdong Province, China. The picture on the right is my hometown Shenzhen. Let me introduce my hometown to you. Shenzhen is one of major cities in China, which is located in the southern part of the countryas well as right next to Hong Kong. As you see in this picture, Shenzhen is a vibrant city with beautiful scenery, mountains of skyscrapers, absorbing countless people to achieve their dream.",
        "content2": "One of the things that makes Shenzhen special is its history. It used to be a small fishing village, but in the 1980s, it was designated as a special economic zone, which helped it to grow and develop into the bustling city it is today. Now, it's a hub of innovation, with lots of high-tech companies based here.",
        "img1": "/image/shenzhen1.jpg",
        "img2": "/image/shenzhen2.jpg"
    },
    {
        "title": "College Life",
        "content1": "During my time in university, I actively participated in various student organizations and clubs. As I became more involved, I was elected as the President of the Student Union in my sophomore year. In this role, I was responsible for leading the team to organize various activities and events for the student body, which required me to communicate effectively with other students, faculty and staff members. ",
        "content2": "Apart from my duties as Student Union President, I also had numerous opportunities to deliver speeches and participate in meetings during my daily campus life. These experiences helped me to develop my public speaking skills, enhance my leadership abilities, and expand my network.Although my schedule was often packed, I found great satisfaction in being able to contribute to the university community and make a positive impact on the lives of my fellow students. Overall, my involvement in these activities has not only enriched my personal life, but also equipped me with valuable skills that will benefit me in my future endeavors.",
        "img1": "/image/collegelife1.jpg",
        "img2": "/image/collegelife2.jpg"
    },
    {
        "title": "My Projects",
        "content1": "This is a study abroad planning and guidance system that I developed with three classmates, mainly using the Vue framework. The system aims to help students understand the application requirements and processes of various universities, and provide specific information and rankings for each school. In addition, students can stay informed about the latest developments and news from the colleges through this website, and communicate and consult with our guidance teachers online. The teachers can help students polish their application materials and improve their competitiveness.",
        "content2": "This is my project for the Introduction to Software Engineering course, which is an ordering system designed for the coffee shop in our college. The system includes two sets of interfaces: one for users and one for administrators.On the user side, customers can view drink details, choose options such as sugar level and temperature, add drinks to their shopping cart, and pay their order using Alipay, a popular payment method in China.On the administrator side, the manager can view the details of orders submitted by users, confirm payment status, and provide feedback on whether the drinks have been prepared. The manager can also modify product information, add or remove items, and access a data analysis page that shows recent sales and revenue for each product.",
        "img1": "/image/project1.jpg",
        "img2": "/image/project2.jpg"
    },
    {
        "title": "Hobbies",
        "content1": "I started learning how to play badminton in primary school and stuck with it for six years. I participated in many competitions and also played with my classmates in my free time. Badminton brings me the joy of exercise and the warmth of friendship, and it taught me how to control my emotions and adapt to my opponents' tactics and skills.",
        "content2": "In addition, my biggest hobby is music. I have learned to play instruments such as saxophone, piano, trombone, and guitar, and have even composed some music pieces on my own. The picture next to this text was taken during a performance I participated in during my middle school years, and music has carried many of my wonderful memories.",
        "img1": "/image/badminton.jpg",
        "img2": "/image/music.jpg"
    }
]